#### Import libraries

In [1]:
import pandas as pd
import numpy as np

#### Reading the data

In [3]:
df = pd.read_csv('../data/large_train_sample.csv')

In [4]:
df.shape

(32561, 14)

In [5]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,sex,capital-gain,capital-loss,hours-per-week,native-country,wage
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Female,0,0,40,Cuba,<=50K

In [6]:
#checking if the data has the correct data type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 14 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
wage              32561 non-null object
dtypes: int64(6), object(8)
memory usage: 3.5+ MB

In [7]:
#checking out of range age.
df.age.describe()

count    32561.000000
mean        38.581647
std         13.640433
min         17.000000
25%         28.000000
50%         37.000000
75%         48.000000
max         90.000000
Name: age, dtype: float64

#### EDA

In [8]:
#Checking for null values
df.isnull().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
wage              0
dtype: int64

No nulls in any of the columns

In [9]:
#checking for the uniques in workclass
df.workclass.value_counts()

 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: workclass, dtype: int64

In [10]:
#checking for the uniques in education
df.education.value_counts()

 HS-grad         10501
 Some-college     7291
 Bachelors        5355
 Masters          1723
 Assoc-voc        1382
 11th             1175
 Assoc-acdm       1067
 10th              933
 7th-8th           646
 Prof-school       576
 9th               514
 12th              433
 Doctorate         413
 5th-6th           333
 1st-4th           168
 Preschool          51
Name: education, dtype: int64

In [11]:
#checking for unique and out of range values
df['education-num'].value_counts(ascending = True)

1        51
2       168
3       333
16      413
8       433
5       514
15      576
4       646
6       933
12     1067
7      1175
11     1382
14     1723
13     5355
10     7291
9     10501
Name: education-num, dtype: int64

In [12]:
#checking for the uniques in marital-status
df['marital-status'].value_counts()

 Married-civ-spouse       14976
 Never-married            10683
 Divorced                  4443
 Separated                 1025
 Widowed                    993
 Married-spouse-absent      418
 Married-AF-spouse           23
Name: marital-status, dtype: int64

In [13]:
#checking for the uniques in occupation
df.occupation.value_counts()

 Prof-specialty       4140
 Craft-repair         4099
 Exec-managerial      4066
 Adm-clerical         3770
 Sales                3650
 Other-service        3295
 Machine-op-inspct    2002
 ?                    1843
 Transport-moving     1597
 Handlers-cleaners    1370
 Farming-fishing       994
 Tech-support          928
 Protective-serv       649
 Priv-house-serv       149
 Armed-Forces            9
Name: occupation, dtype: int64

In [14]:
#checking for the uniques in relationship
df.relationship.value_counts()

 Husband           13193
 Not-in-family      8305
 Own-child          5068
 Unmarried          3446
 Wife               1568
 Other-relative      981
Name: relationship, dtype: int64

In [15]:
#checking for the uniques in sex
df.sex.value_counts()

 Male      21790
 Female    10771
Name: sex, dtype: int64

In [16]:
df['capital-gain'].value_counts().head()

0        29849
15024      347
7688       284
7298       246
99999      159
Name: capital-gain, dtype: int64

In [17]:
df['capital-loss'].value_counts().head()

0       31042
1902      202
1977      168
1887      159
1848       51
Name: capital-loss, dtype: int64

In [18]:
df['hours-per-week'].value_counts()

40    15217
50     2819
45     1824
60     1475
35     1297
      ...
92        1
94        1
87        1
74        1
82        1
Name: hours-per-week, Length: 94, dtype: int64

In [19]:
#checking for the uniques in native-country
df['native-country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Trinadad&Tobago                  19
 Cambodia                         19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Honduras                         13
 Hungary                          13
 Scotland                         12
 Holand-Netherlands                1
Name: native-country, dtype: int64

In [20]:
#checking for the uniques in wage
df.wage.value_counts()

 <=50K    24720
 >50K      7841
Name: wage, dtype: int64

There is an extra space behind each of the instances in our data. we will remove this space

In [21]:
#removes any spaces before or after the instances in all of our dataFrame
df = df.apply(lambda x: x.str.strip() if x.dtype == 'object' else x)

In the columns occupation, workclass and native-country, we have a '?'. We will replace it with 'Others' for each of these columns

In [22]:
df['occupation'].replace('?', 'Other', inplace=True)

In [23]:
df['workclass'].replace('?', 'Other', inplace=True)

In [24]:
df['native-country'].replace('?', 'Other', inplace=True)

In [25]:
df['native-country'].replace('Holand-Netherlands', 'Other', inplace=True)

Saving the cleaned training file:

In [26]:
df['wage'] = df['wage'].map({'<=50K':0, '>50K': 1})

In [27]:
df.to_csv('../data/large_clean.csv', index=False)